---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter
source: html/980270b7-8e30-5c7b-d097-39ddcf30f8de.htm
---
# StructuralMaterialTypeFilter Properties

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.